import { GameThemeName } from './data'
import { type Coordinates } from './typings'

/** Координаты сущностей на sprite-изображении с классическим дизайном */
const coordinates: Coordinates = {
  [GameThemeName.Classic]: {
    'player.primary': {
      UP: [
        [850, 450, 50, 50],
        [850, 500, 50, 50],
        [850, 550, 50, 50],
      ],
      DOWN: [
        [850, 150, 50, 50],
        [850, 200, 50, 50],
        [850, 250, 50, 50],
      ],
      LEFT: [
        [850, 300, 50, 50],
        [850, 350, 50, 50],
        [850, 400, 50, 50],
      ],
      RIGHT: [
        [850, 0, 50, 50],
        [850, 50, 50, 50],
        [850, 100, 50, 50],
      ],
    },
    'player.secondary': {
      UP: [
        [4, 532, 52, 52],
        [68, 532, 52, 52],
      ],
      DOWN: [
        [264, 528, 52, 52],
        [328, 528, 52, 52],
      ],
      LEFT: [
        [136, 528, 52, 52],
        [204, 528, 52, 52],
      ],
      RIGHT: [
        [392, 528, 52, 52],
        [460, 528, 52, 52],
      ],
    },
  },

  [GameThemeName.Modern]: {
    'player.primary': {
      UP: [
        [4, 8, 52, 52],
        [68, 8, 52, 52],
      ],
      DOWN: [
        [264, 4, 52, 52],
        [328, 4, 52, 52],
      ],
      LEFT: [
        [136, 4, 52, 52],
        [204, 4, 52, 52],
      ],
      RIGHT: [
        [392, 4, 52, 52],
        [460, 4, 52, 52],
      ],
    },
    'player.secondary': {
      UP: [
        [4, 532, 52, 52],
        [68, 532, 52, 52],
      ],
      DOWN: [
        [264, 528, 52, 52],
        [328, 528, 52, 52],
      ],
      LEFT: [
        [136, 528, 52, 52],
        [204, 528, 52, 52],
      ],
      RIGHT: [
        [392, 528, 52, 52],
        [460, 528, 52, 52],
      ],
    },
  },
}

/** Координаты сущностей на sprite-изображении */
/** TODO: Для смены тем заменить на let и добавить алгоритм смены переменной **/
export const spriteCoordinates = coordinates[GameThemeName.Classic]
